Repository: josephinecowley/logic_simulator_GF2
Catalog: logsim/logsim/locales/*/LC_MESSAGES/translate.po
Languages: el, es_es

source: Welcome to our Logic Simulator!
el: Καλώς ήρθατε στον Προσομοιωτή Λογικής μας!
es_es: Bienvenido a nuestro simulador de lógica!

source: To get started you need a valid Logic Description File. This is one which follows our defined language syntax.
el: Για να ξεκινήσετε, χρειάζεστε ένα έγκυρο Αρχείο Λογικής Περιγραφής. Αυτή είναι μια σύνταξη που ακολουθεί την καθορισμένη σύνταξη γλώσσας.
es_es: Para comenzar, necesita un archivo de descripción lógica válido. Este es uno que sigue nuestra sintaxis de lenguaje definida.

source: Click on the “UPLOAD” button in the bottom right corner of the simulator tab and follow the command prompt to select your logic description file.
el: Κάντε κλικ στο κουμπί ΑΝΕΒΑΣΗ στην κάτω δεξιά γωνία της καρτέλας του προσομοιωτή και ακολουθήστε τη γραμμή εντολών για να επιλέξετε το αρχείο περιγραφής λογικής.
es_es: Haga clic en el botón CARGAR en la esquina inferior derecha de la pestaña del simulador y siga el símbolo del sistema para seleccionar su archivo de descripción lógica.

source: Upon clicking this, if you have uploaded a valid Logic Description File, you should see the y-axis of each monitor you have specified, along with all of the valid switches you have added in your logic circuit.
el: Κάνοντας κλικ σε αυτό, εάν έχετε μεταφορτώσει ένα έγκυρο Αρχείο Λογικής Περιγραφής, θα πρέπει να δείτε τον άξονα y κάθε οθόνης που έχετε καθορίσει, μαζί με όλους τους έγκυρους διακόπτες που έχετε προσθέσει στο λογικό σας κύκλωμα.
es_es: Al hacer clic aquí, si ha cargado un archivo de descripción lógica válido, debería ver el eje Y de cada monitor que ha especificado, junto con todos los interruptores válidos que ha agregado en su circuito lógico.

source: You can update the number of monitors using the “Add new monitor” and “Zap a monitor” drop down boxes, which provides names of device output ports which you could monitor.
el: Μπορείτε να ενημερώσετε τον αριθμό των οθονών χρησιμοποιώντας τα αναπτυσσόμενα πλαίσια Προσθήκη νέας οθόνης και Διαγράψτε μια οθόνη, τα οποία παρέχουν ονόματα θυρών εξόδου συσκευής που θα μπορούσατε να παρακολουθήσετε. Αφού καθορίσετε την οθόνη που θέλετε να προσθέσετε ή να κάνετε Διαγράφω, πρέπει να πατήσετε τα αντίστοιχα κουμπιά + (για την προσθήκη οθόνης) ή - (για ζάπινγκ μιας οθόνης) στα δεξιά αυτών των αναπτυσσόμενων πλαισίων.
es_es: Puede actualizar la cantidad de monitores mediante los cuadros desplegables Agregar nuevo monitor y Eliminar un monitor, que proporcionan los nombres de los puertos de salida del dispositivo que puede monitorear.

source: Once you have specified the monitor that you want to add or zap, you must press the corresponding “+” (for adding a monitor) or “-” (for zapping a monitor) buttons on the right of these dropdown boxes.
el: Αφού καθορίσετε την οθόνη που θέλετε να προσθέσετε ή να κάνετε ζάπ, πρέπει να πατήσετε τα αντίστοιχα κουμπιά «+» (για την προσθήκη οθόνης) ή «-» (για ζάπινγκ μιας οθόνης) στα δεξιά αυτών των αναπτυσσόμενων πλαισίων.
es_es: Una vez que haya especificado el monitor que desea agregar o eliminar, debe presionar los botones correspondientes + (para agregar un monitor) o - (para eliminar un monitor) a la derecha de estos cuadros desplegables.

source: Upon doing so, you should see the monitors update.
el: Μόλις το κάνετε αυτό, θα δείτε την ενημέρωση των οθονών.
es_es: Al hacerlo, debería ver la actualización de los monitores.

source: You can also change the initial state of the switches in your circuit by using the toggle buttons. Blue indicates the switch state is ON and grey indicates the switch state is OFF.
el: Μπορείτε επίσης να αλλάξετε την αρχική κατάσταση των διακοπτών στο κύκλωμά σας χρησιμοποιώντας τα κουμπιά εναλλαγής. Το μπλε υποδηλώνει ότι η κατάσταση του διακόπτη είναι ΕΠΙ και το γκρι υποδεικνύει ότι η κατάσταση του διακόπτη είναι ΜΑΚΡΙΑ ΑΠΟ.
es_es: También puede cambiar el estado inicial de los interruptores en su circuito usando los botones de alternancia. El azul indica que el estado del interruptor está ENCENDIDO y el gris indica que el estado del interruptor está APAGADO.

source: Now specify the number of cycles you wish to run by using the spin button in the bottom left corner of the simulator.
el: Τώρα καθορίστε τον αριθμό των κύκλων που θέλετε να εκτελέσετε χρησιμοποιώντας το κουμπί περιστροφής στην κάτω αριστερή γωνία του προσομοιωτή.
es_es: Ahora especifique la cantidad de ciclos que desea ejecutar usando el botón giratorio en la esquina inferior izquierda del simulador.

source: Now you can press the large green “RUN” button in the bottom left hand corner.
el: Τώρα μπορείτε να πατήσετε το μεγάλο πράσινο κουμπί ΤΡΕΞΙΜΟ στην κάτω αριστερή γωνία.
es_es: Ahora puede presionar el botón verde grande EJECUTAR en la esquina inferior izquierda.

source: If successful, you should see the signal traces update for each monitored device.
el: Εάν είναι επιτυχής, θα πρέπει να δείτε την ενημέρωση των ιχνών σήματος για κάθε συσκευή που παρακολουθείται.
es_es: Si tiene éxito, debería ver la actualización de los rastros de señal para cada dispositivo monitoreado.

source: Note that upon clicking “RUN” this button will change to an orange “CONTINUE” button. Click this if you want to add further simulations.
el: Σημειώστε ότι κάνοντας κλικ στο ΤΡΕΞΙΜΟ αυτό το κουμπί θα αλλάξει σε ένα πορτοκαλί κουμπί ΣΥΝΕΧΕΙΑ. Κάντε κλικ σε αυτό εάν θέλετε να προσθέσετε περαιτέρω προσομοιώσεις. Μπορείτε πάντα να αλλάξετε τον αριθμό των καθορισμένων κύκλων ή τις καταστάσεις ή τις οθόνες του διακόπτη μεταξύ κάθε προσομοίωσης.
es_es: Tenga en cuenta que al hacer clic en EJECUTAR, este botón cambiará a un botón naranja CONTINUAR. Haga clic aquí si desea agregar más simulaciones.

source: You can always change the number of cycles specified or the switch states or monitors in between each simulation.
el: Μπορείτε πάντα να αλλάξετε τον αριθμό των καθορισμένων κύκλων ή τις καταστάσεις ή τις οθόνες του διακόπτη μεταξύ κάθε προσομοίωσης.
es_es: Siempre puede cambiar la cantidad de ciclos especificados o los estados del interruptor o los monitores entre cada simulación.

source: Hello
el: Γειά σου
es_es: Hola

source: GF2 P2 Team 7 Logic Simulator GUI:
el: GF2 P2 Ομάδα 7 Προσομοιωτής Λογικής GUI:
es_es: GUI del simulador lógico Equipo 7:

source: &Exit
el: Εξοδος
es_es: Salga

source: &File
el: Αρχείο
es_es: Archivo

source: Logic Simulator Created by Josephine Cowley (jhmdc2), Tom Hill (th621), Khalid Omar (ko366) 2023
el: Προσομοιωτής Λογικής Δημιουργήθηκε από Josephine Cowley (jhmdc2), Tom Hill (th621), Khalid Omar (ko366) 2023
es_es: Simulador Lógico Creado por Josephine Cowley (jhmdc2), Tom Hill (th621), Khalid Omar (ko366) 2023

source: About Logsim
el: Σχετικά με το Logsim
es_es: Acerca de Logsim

source: GF2 P2 Team 7 Logic Simulator GUI
es_es: GUI del simulador lógico Equipo 7

source: Need some help?
es_es: ¿Necesito ayuda?

source: Click here to learn how to use our Logic Simulator
es_es: Haga clic aquí para aprender a usar nuestro Simulador Lógico

source: Pre-loaded Logic Description File:
es_es: Precargado Archivo de descripción lógica:

source: Upload new file
es_es: Subir archivo nuevo

source: Upload a new Logic Description File
es_es: Subir archivo nuevo

source: Continue
es_es: Continuar

source: Continue with preloaded logic description file
es_es: Continuar con el archivo de descripción lógica precargado

source: NO. CYCLES
el: ΑΡΙΘΜΟΣ ΚΥΚΛΩΝ
es_es: NO. CICLOS

source: RUN
el: ΤΡΕΞΙΜΟ
es_es: CORRA

source: Begin running the simulation
el: Ξεκινήστε την εκτέλεση της προσομοίωσης
es_es: Comenzar a ejecutar la simulación

source: CLEAR
el: ΣΑΦΗ
es_es: ACLARE

source: Clear all signal traces
el: Διαγράψτε όλα τα ίχνη σήματος
es_es: Borrar todos los rastros de señal

source: RESET
el: ΕΠΑΝΑΦΟΡΑ
es_es: REINICIE

source: Reset the simulation from initialisation
el: Επαναφέρετε την προσομοίωση από την αρχικοποίηση
es_es: Restablecer la simulación desde la inicialización

source: An error occurred.
el: Παρουσιάστηκε σφάλμα.
es_es: Ocurrió un error.

source: QUIT
el: ΕΓΚΑΤΑΛΕΙΠΩ
es_es: SALGA

source: Quit the simulation
el: Κλείστε την προσομοίωση
es_es: Salir de la simulación

source: UPLOAD
el: ΑΝΕΒΑΣΗ
es_es: SUBE

source: Upload logic description file
el: Ανεβάστε το αρχείο περιγραφής λογικής
es_es: Subir archivo de descripción lógica

source: HELP
el: ΒΟΗΘΕΙΑ
es_es: AYUDE

source: SETTINGS
el: ΡΥΘΜΙΣΕΙΣ
es_es: AJUSTES

source: Change system settings
el: Αλλάξτε τις ρυθμίσεις συστήματος
es_es: Cambiar la configuración del sistema

source: Help on running logic simulation
el: Βοήθεια για την εκτέλεση λογικής προσομοίωσης
es_es: Ayuda para ejecutar la simulación lógica

source: CONTINUE
el: ΝΑ ΣΥΝΕΧΙΣΕΙ
es_es: CONTINÚA

source: Continue running the simulation
el: Συνεχίστε την εκτέλεση της προσομοίωσης
es_es: Continuar ejecutando la simulación.

source: Error! Network oscillating.
el: Λάθος! Δίκτυο που ταλαντώνεται.
es_es: ¡Error! Red oscilante.

source: Configure Logic Simulator GUI settings
es_es: Configurar los ajustes de la GUI del simulador lógico

source: GUI Settings
es_es: Configuración de la interfaz gráfica de usuario

source: Select language
es_es: Seleccione el idioma

source: CONFIRM SETTINGS
es_es: CONFIRMAR AJUSTES

source: Confirm settings changes
es_es: Confirmar cambios de configuración

source: Tutorial on GF2 Team 7 Logic Simulator
el: Εκμάθηση για GF2 Ομάδα 7 Προσομοιωτής Λογικής
es_es: Tutorial sobre el simulador lógico GF2 Equipo 7

source: Select output
el: Επιλέξτε έξοδο
es_es: Seleccione una salida

source: ADD NEW MONITOR
el: ΠΡΟΣΘΗΚΗ ΝΕΑΣ ΟΘΟΝΗΣ
es_es: AGREGAR NUEVO MONITOR

source: DELETE MONITOR
el: ΔΙΑΓΡΑΦΗ ΟΘΟΝΗΣ
es_es: ELIMINAR MONITOR

source: Add a monitor
el: Προσθέστε μια οθόνη
es_es: Añadir un monitor

source: Delete an existing monitor
el: Διαγράψτε μια υπάρχουσα οθόνη
es_es: Eliminar un monitor existente

source: RECENTER
el: ΠΡΟΣΦΟΡΑ
es_es: A CENTRAR

source: Recenter the signal traces
el: Επικεντρώστε τα ίχνη σήματος
es_es: Vuelva a centrar las trazas de la señal

source: INPUTS
el: ΕΙΣΟΔΟΙ
es_es: ENTRADAS

source: ON
el: ΕΠΙ
es_es: ENCENDIDO

source: OFF
el: ΜΑΚΡΙΑ ΑΠΟ
es_es: APAGADO
